#include "delay.h"
#include<intrins.h>
/*------------------------------------------------
 uS延时函数，t其值的范围是0~255 这里使用晶振12M，
 大致延时长度如下 T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
 while(--t);
}
/*------------------------------------------------
 mS延时函数，t其值的范围是0~255 这里使用晶振12M，
 精确延时请使用汇编
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
 while(t--)
 {
     //大致延时1mS
     DelayUs2x(245);
	 DelayUs2x(245);
 }
}
/*------------------------------------------------
10us延时函数
------------------------------------------------*/
void delay10us()
{
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
   _nop_();
}
/*------------------------------------------------
10ms延时函数
------------------------------------------------*/
void delay10ms(unsigned char t)
{
   unsigned char i,j,k;
   for(i=0;i<t;i++)
      for(j=0;j<40;j++)
	     for(k=0;k<75;k++);
}